# CannotDrawStairs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotDrawStairs Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't make stairs
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDrawStairs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDrawStairs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDrawStairs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace